<a href="https://colab.research.google.com/github/skimaza/colab_test/blob/main/pandas_for_json_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame([[1, 'one'], [2, 'two'], [3, 'three'], [4, 'one']], columns=['val', 'eng'])

In [ ]:
df

   val    eng
0    1    one
1    2    two
2    3  three
3    4    one

In [ ]:
print(df.head)

<bound method NDFrame.head of    val    eng
0    1    one
1    2    two
2    3  three
3    4    one>

In [ ]:
df.sort_values('eng')

   val    eng
0    1    one
3    4    one
2    3  three
1    2    two

In [ ]:
df

   val    eng
0    1    one
1    2    two
2    3  three
3    4    one

In [ ]:
sdf = df.sort_values('eng')

In [ ]:
sdf

   val    eng
0    1    one
3    4    one
2    3  three
1    2    two

In [ ]:
new = sdf.groupby(sdf['eng'])

In [ ]:
new.apply(lambda x: x['val'].values.tolist())

eng
one      [1, 4]
three       [3]
two         [2]
dtype: object

In [ ]:
sdf

   val    eng
0    1    one
3    4    one
2    3  three
1    2    two

In [ ]:
new = sdf.groupby(sdf['eng']).apply(lambda x: x['val'].values.tolist())

In [ ]:
new

eng
one      [1, 4]
three       [3]
two         [2]
dtype: object

In [ ]:
new.head

<bound method NDFrame.head of eng
one      [1, 4]
three       [3]
two         [2]
dtype: object>